<?php
/****************************************************************************************
 *******  // СБОРКА ЗАКАЗОВ ЗА ОПРЕДЕЛЕННУЮ ДАТУ
 ***************************************************************************************/
function select_order_by_check_date($token_wb, $date_orders) {
/// **********************ДАТА СБОРА ЗАКАЗОВ ****************************************************
    // $date_orders = '2024-06-02';
 ///////////////////////////////////////////////////////////////////////////////////   

    if ($date_orders == '') {
        // когда дата не выбрана берем все заказы
        $arr_new_zakaz = get_all_new_zakaz ($token_wb);
    } else {
        // когда выбрана дата, то выберем заказы только на одну дату
        $raw_arr_orders_t = get_all_new_zakaz ($token_wb);

        foreach ($raw_arr_orders_t['orders'] as $order) {

            if (substr($order['createdAt'],0,10) == $date_orders) { // сортировка только по выбранной дате
                $arr_new_zakaz['orders'][] = $order;
            }
        
        }
    }
    if (isset($arr_new_zakaz)) {
        return $arr_new_zakaz;
    }
}


/****************************************************************************************
 *******  
 ***************************************************************************************/

