<?php
$art_catalog = array (
'7245' => 'Бордюр Anmaks садовый бордюр 7245 100 см 4.5 см черный',
'7260' => 'Бордюр Anmaks садовый бордюр 7260 100 см 6 см черный',
'7280' => 'Бордюр Anmaks садовый бордюр 7280 100 см 8 см черный',

'7245-К-16' => 'Садовый бордюр Anmaks 7245-К-16 Экобордюр Контур пластиковый 1000х45 мм 16 шт',
'7260-К-12' => 'Садовый бордюр Anmaks 7260-К-12 Экобордюр Контур пластиковый 1000х60 мм 12 шт',
'7280-К-8'  => 'Садовый бордюр Anmaks 7280-К-8 Экобордюр Контур пластиковый 1000х80, 8 штук',

'7245-к-10' => '7245-К-10 Экобордюр КОНТУР Б-100.05.08 пластиковый черный L-1000 мм, H-45 мм, (10 бордюров )',
'7260-к-8' => '7260-К-8 Экобордюр КОНТУР Б-100.06.08 пластиковый черный L-1000 мм, H-60 мм, (8 бордюров)',
'7280-к-6' => '7280-К-6 Экобордюр КОНТУР Б-100.08.08 пластиковый черный L-1000 мм, H-80 мм, (6 бордюров)',

'7245-к-10-30' => '7245-К-10-30 Экобордюр КОНТУР Б-100.05.08 пластиковый черный L-1000 мм, H-45 мм, (10 бордюров + 30 крепежных якорей)',
'7260-к-8-24' => '7260-К-8-24 Экобордюр КОНТУР Б-100.06.08 пластиковый черный L-1000 мм, H-60 мм (8 бордюров + 24 крепежных якорей)',
'7280-к-6-18' => '7280-К-6-18 Экобордюр КОНТУР Б-100.08.08 пластиковый черный L-1000 мм, H-80 мм, (6 бордюров + 18 крепежных якоря)',


'8910-30' => 'Крепящий анкер Anmaks 8910-30 универсальный пластиковый 30 шт',
'1940-10' => 'Крепящий якорь Anmaks 1940-10 к бордюру Кантри сталь 10 шт',
'1840-30' => 'Крепящий якорь Anmaks 1840-30 универсальный. Пластик. 30 штук',

'82400-К'  => 'Садовый бордюр Anmaks 82400-К Кантри MINI пластиковый коричневый 10000х80 мм',
'82401-К'  => 'Садовый бордюр Anmaks 82401-К Кантри коричневый 10000х110 мм',
'82402-К'  => 'Садовый бордюр Anmaks 82402-К Кантри MAXI коричневый 10000х140 мм',

'82400-Ч'  => 'Садовый бордюр Anmaks 82400-Ч Кантри MINI пластиковый черный 10000х80 мм',
'82401-Ч'  => 'Садовый бордюр Anmaks 82401-Ч Кантри черный 10000х110 мм',
'82402-Ч'  => 'Садовый бордюр Anmaks 82402-Ч Кантри MAXI черный 10000х140 мм',

'82400-З'  => 'Садовый бордюр Anmaks 82400-З Кантри MINI пластиковый зеленый 10000х80 мм',
'82401-З'  => 'Садовый бордюр Anmaks 82401-З Кантри зеленый 10000х110 мм',
'82402-З'  => 'Садовый бордюр Anmaks 82402-З Кантри MAXI зеленый 10000х140 мм',

'7262-КП' => 'Садовый приствольный круг Anmaks КОНТУР-КП-60.06',

'503А' => 'Решетка водоприемная ANMAKS 503А щелевая из нержавеющей стали 1000х136мм цвет сталь',
'508АК' => 'Решетка водоприемная ANMAKS 508АК щелевая оцинкованная под крепеж 1000х136мм цвет сталь',
'508А' => 'Решетка водоприемная ANMAKS DN100 стальная оцинкованная, 1000х136 мм',
'508АК-10' => 'Решетка водоприемная ANMAKS 508АК-10 щелевая оцинкованная 1000х136мм цвет сталь 10 шт',

'503А-10' => 'Решетка водоприемная ANMAKS 503А-10 щелевая из нержавеющей стали 1000х136мм цвет сталь 10 шт',



'508А-10' => 'Решетка водоприемная ANMAKS DN100 щелевая стальная оцинкованная, 1000х136 мм. Комплект - 10 штук',
'6800А-10' => 'Крепеж для пластиковых лотков ANMAKS 6800А-10 150х50мм цвет черный 10 шт',

'ANM.39*59' => 'Решетка придверная грязезащитная ANMAKS сталь 39х59 cм',
'ANM.49*99' => 'Решетка придверная грязезащитная ANMAKS сталь 49х99 cм'



);

