<?php
    $arr_type_find_servives['Услуги доставки'] = 
                          array(
                                'MarketplaceServiceItemDirectFlowLogistic' => 'Прямая логистика',
                                'MarketplaceServiceItemReturnFlowLogistic' => 'Обратная логистика',
                                'MarketplaceServiceItemDropoffSC' => 'Обработка отправления Drop-off',
                                'MarketplaceServiceItemDropoffPVZ' => 'Обработка отправления Drop-off',
                               
                                );


    $arr_type_find_servives['Услуги агентов'] = 
                               array(
                                     'MarketplaceServiceItemRedistributionLastMileCourier' => 'Доставка до места выдачи',
                                     'MarketplaceServiceItemRedistributionReturnsPVZ' => 'Обработка возвратов, отмен и невыкупов партнёрами',
                                     'MarketplaceServiceItemDelivToCustomer' => 'Выдача товара',
                                     'MarketplaceServiceItemRedistributionLastMilePVZ' => 'Выдача товара',
                                     'Временное размещение товара партнерами' => 'Временное размещение товара партнерами'

                                     
                                ) ;

    $arr_type_find_servives['Продвижение и реклама'] =  array(
            'Ускоренный сбор отзывов' => 'Ускоренный сбор отзывов', 
            'Закрепление отзыва' => 'Закрепление отзыва', 
            'Генерация видеообложки' => 'Генерация видеообложки',
            'Услуги продвижения товаров' => 'Услуги продвижения товаров',
            'Баллы за отзывы'=> 'Баллы за отзывы',
            'Оплата за клик'=> 'Оплата за клик',
            'Иные электронные услуги'=> 'Иные электронные услуги',
            'Приобретение отзывов на платформе'=> 'Приобретение отзывов на платформе',
            'Вывод в топ'=> 'Вывод в топ',
            'Трафареты'=> 'Трафареты',
            'Продвижение в поиске'=> 'Продвижение в поиске',
            'Premium-подписка'=> 'Premium-подписка',
            'Подписка Premium Pro'=> 'Подписка Premium Pro',
            'Подписка Premium Pro (процент)'=> 'Подписка Premium Pro (процент)',
            'Подписка Premium'=> 'Подписка Premium',
            'Подписка Premium Plus'=> 'Подписка Premium Plus',
            'Продвижение с оплатой за заказ'=> 'Продвижение с оплатой за заказ',
            'Продвижение бренда' =>'Продвижение бренда',
        );


     $arr_type_find_servives['Услуги ФБО'] = array(
            'Подготовка товара к вывозу: Валид' => 'Подготовка товара к вывозу: Валид',
            'Услуга размещения товаров на складе' => 'Услуга размещения товаров на складе',
            'Услуга по бронированию места и персонала для поставки с неполным составом в составе ГМ' => 'Услуга по бронированию места и персонала для поставки с неполным составом в составе ГМ',
            'Обработкабрака с приемки' => 'Обработкабрака с приемки',
            'Услуга по обработке опознанных излишков в составе ГМ' => 'Услуга по обработке опознанных излишков в составе ГМ',
            'Подготовка товара к вывозу: Брак' => 'Подготовка товара к вывозу: Брак',
            'Обработка брака с приемки' => 'Обработка брака с приемки',
            'Вывоз товара со Склада силами Ozon: Доставка до ПВЗ' => 'Вывоз товара со Склада силами Ozon: Доставка до ПВЗ',
            'Кросс-докинг' => 'Кросс-докинг',
            'Услуга по бронированию места и персонала для поставки с неполным составом' => 'Услуга по бронированию места и персонала для поставки с неполным составом',);
      
            
 $arr_type_find_servives['Другие услуги и штрафы']  = array(
    
   'Жалобы покупателей: привезли не тот товар'=> 'Жалобы покупателей: привезли не тот товар',

    'Отгрузка в нерекомендованный слот'=> 'Отгрузка в нерекомендованный слот',
    'Временное размещение товара в СЦ/ПВЗ'=> 'Временное размещение товара в СЦ/ПВЗ',
    'Услуга по дополнительной обработке ОВХ'=> 'Услуга по дополнительной обработке ОВХ',
    
    'Обеспечение материалами для упаковки товара'=> 'Обеспечение материалами для упаковки товара',
    'Упаковка товара партнёрами'=> 'Упаковка товара партнёрами',
    
    'Начисление за хранение/утилизацию возвратов'=> 'Начисление за хранение/утилизацию возвратов',
    'Утилизация товара: Повреждённые из-за упаковки'=> 'Утилизация товара: Повреждённые из-за упаковки',
    'Утилизация товара: Вы не забрали в срок' => 'Утилизация товара: Вы не забрали в срок', 
    
    'Обработка операционных ошибок продавца: отгрузка в нерекомендованный слот'=> 'Обработка операционных ошибок продавца: отгрузка в нерекомендованный слот',
    'Обработка операционных ошибок продавца: отгрузка в нерекомендованный слот - отмена начисления'=> 'Обработка операционных ошибок продавца: отгрузка в нерекомендованный слот - отмена начисления',

    'Услуга за обработку операционных ошибок продавца: просроченная отгрузка'=> 'Услуга за обработку операционных ошибок продавца: просроченная отгрузка',
    'Услуга за обработку операционных ошибок продавца: просроченная отгрузка - отмена начисления'=> 'Услуга за обработку операционных ошибок продавца: просроченная отгрузка - отмена начисления',
    'Услуга за обработку операционных ошибок продавца: отмена'=> 'Услуга за обработку операционных ошибок продавца: отмена',

    'Превышение индекса ошибок: просроченная отгрузка'=> 'Превышение индекса ошибок: просроченная отгрузка',
    'Превышение индекса ошибок: отмена' => 'Превышение индекса ошибок: отмена', 

                           );


   
$arr_type_find_servives['Прочие начисления'] = array(
    'Корректировки стоимости услуг' =>'Корректировки стоимости услуг',
);                            
    


// $arr_type_find_servives['сервисы'] =  $arr_services_types_rus;
    
    


// print_r($arr_type_find_servives);
/*****************************************************************************
 * функция ищет в массиве сервисов к какому типа расходов она относится,
 * затем в массив заносит русское название расходов и его сумму
 * затем удаляет разнесенные сервисы
 *****************************************************************************/
function raspredelenie_servicnih_rashodov_ozon_report (&$arr_for_sum_table, &$array_with_data ,  $arr_type_find_servives) {
    // $nashli_tratu = 0;
    foreach ($array_with_data as $service=>$service_summa) {
        $nashli_tratu = 0;
         // Удаляем нулевые статьи затрат
    if ($service_summa == 0) {
         unset($array_with_data[$service]);
         continue; 
    }   
        foreach ($arr_type_find_servives as $category=>$service_type_spisok){
            foreach ($service_type_spisok as $ozon_type_service=>$rus_name_service){
                if ($ozon_type_service == $service ) {
                   $arr_for_sum_table[$category][$rus_name_service] =  @$arr_for_sum_table[$category][$rus_name_service] + $service_summa;
                         unset($array_with_data[$service]);
                   $nashli_tratu = 1;
                }
            
            }

 
     }
     if (($service == 'summa ') AND ($nashli_tratu == 0)) {echo "$service = $service_summa<br>";}
    }


// return $arr_for_sum_table;
}