<?php


// $Nomer_Nalog_diclar = 'ON_NSCHFDOPPR_2BM-7721546864-2012052808220682662630000000000_2BM-7727830864-772701001-201407211008287437442_20230803_bd0c0d36-8c65-46b2-ba23-e2f112ef51eb';
// $idOtpravl = '2BM-7727830864-772701001-201407211008287437442';
// $idPol = "2BM-7721546864-2012052808220682662630000000000";
// $vremiaPrInfo= "16.32.15";
// $DataPrInfo = "03.08.2023";


$ttt = '<Файл ИдФайл="'.$nalog_form_UPD.'" ВерсФорм="5.01" ВерсПрог="Diadoc 1.0">';
 file_put_contents('test.xml',$ttt, FILE_APPEND);
 file_put_contents('test.xml',"&#xA;", FILE_APPEND);
 

$ttt= '<СвУчДокОбор ИдОтпр="'.$idOtpravl.'" ИдПол="'.$idPol.'">
<СвОЭДОтпр ИННЮЛ="6663003127" ИдЭДО="2BM" НаимОрг="АО &quot;ПФ &quot;СКБ Контур&quot;"/></СвУчДокОбор>';
file_put_contents('test.xml',$ttt, FILE_APPEND);
file_put_contents('test.xml',"&#xA;", FILE_APPEND);


$ttt= '<Документ КНД="1115131" ВремИнфПр="'.$vremiaPrInfo.'" ДатаИнфПр="'.$DataPrInfo.'" НаимЭконСубСост="Общество с ограниченной ответственностью &quot;Торговый Дом &quot;Анмакс&quot;, ИНН 7727830864, КПП 772701001" Функция="СЧФДОП" ПоФактХЖ="Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)" НаимДокОпр="Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)">';
file_put_contents('test.xml',$ttt, FILE_APPEND); 