<?php 

/**********************************************************************************************************************
 ********************   Функия подменяет СКУ ФБО на СКУ ФБС 
 **********************************************************************************************************************/
function change_SKU_fbo_fbs($ozon_sebest, $sku){
    /// Функия подменяет СКУ ФБО на СКУ ФБС - 
        foreach ($ozon_sebest as $item_cat) {
            if ($sku == $item_cat['skuFBO']) {
                $new_sku  = $item_cat['sku'];
                break;
            } else {$new_sku  = $sku;}
    
        }
        
        return $new_sku;
        }

/**********************************************************************************************************************
 ********************   Функия возвращает Артикул по СКУ ФБС **********************************************************
 **********************************************************************************************************************/

function get_article_by_sku_fbs($ozon_sebest, $sku) {
    foreach ($ozon_sebest as $item_cat) {
        if (($sku == $item_cat['sku']) OR (($sku == $item_cat['skuFBO']))) {
            $article = $item_cat['mp_article'];
            break;
        } else {$article  = 'SKU = '.$sku;}

    }
    
    return $article;
    }

/**********************************************************************************************************************
 ********************   Функия возвращает Артикул из 1С по СКУ ФБС **********************************************************
 **********************************************************************************************************************/

 function get_main_article_by_sku_fbs($ozon_sebest, $sku) {
    foreach ($ozon_sebest as $item_cat) {
        // echo "<br>+".$sku."__88__".$item_cat['sku']."__<br>";
        if (($sku == $item_cat['sku']) OR (($sku == $item_cat['skuFBO']))) {
            $article = $item_cat['main_article'];
            break;
        } else {$article  = 'SKU = '.$sku;}

    }
    
    return $article;
    }


    /**********************************************************************************************************************
 ********************   Функия возвращает Артикул из 1С по СКУ ФБС **********************************************************
 **********************************************************************************************************************/

 function print_on_screen_one_string_and_return_summ($main_summa, $dop_summa,$print_string) {
    echo "(Доп.Услуга) $print_string : $dop_summa<br>";
    $main_summa+=$dop_summa;

    return $main_summa;
    }


